УправлениеДомашнимиРасходами/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеДомашнимиРасходами/src/CommonModules/ОбщийМодульПокупкиВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Функция НоменклатураПоВиду(Знач ВидНоменклатуры, Знач Наименование = "") Экспорт

	Запрос = НовыЙ Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	(Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|	И ДЛИНАСТРОКИ(&Наименование) <> 0
	|	И Номенклатура.Наименование ПОДОБНО &Наименование) 
	|	ИЛИ
	|	(Номенклатура.ВидНоменклатуры = &ВидНоменклатуры 
	|	И ДЛИНАСТРОКИ(&Наименование) = 0)";

	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Выборка = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Возврат  Выборка;
КонецФункции

Функция ПолучитьЕд_измПоСсылкеНаТовар(Знач Товар) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
		|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка",Товар.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если  Выборка.Следующий() Тогда 
		ЕдИзм= Выборка.ЕдиницаИзмерения;
		Возврат  ЕдИзм;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
